Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: ཅུང་ཟད་བྱས་པ་ཡང་ཆུད་མི་གཟོན་ན་མང་པོ་ལྟ་ཅི་སྨོས་ཏེ།
en: They repay the kindness of others without neglecting even minor acts, so there is no need to speak of greater acts.

source: བྱས་པ་གཟོ་བ་རྣམས་ཡིན། བྱས་པ་ཚོར་བ་རྣམས་ཡིན་ཏེ། དགོས་པ་བྱས་པ་ལ་མི་སྨོད་མི་སྐྱུད། ཡོན་ཏན་མ་ཡིན་པར་མི་ལྟ་སྟེ།
en: They notice what has been done and do not belittle, forget, or neglect any meaningful act.

source: གཞན་དུ་ན་ཅུང་ཟད་བྱས་པ་ཡང་ཚོར་ཞིང་དེ་ལ་སྟོད་པར་བྱེད། གཟེངས་སྟོད་པར་བྱེད། ཡང་དག་པར་དགའ་བར་བྱེད། རབ་ཏུ་བསྔགས་པར་བྱེད། དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བ་ཡིན་ནོ།
en: Moreover, even such minor acts are noticed and commended, encouraged, appreciated, praised, and considered significant.

source: ཇི་ལྟར་སྨྲ་བ་དེ་ལྟར་བྱེད་པ་རྣམས་ཡིན་ཏེ།
en: “Furthermore, they act in accord with their words.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངག་གིས་སྙན་པར་སྟོན་ཅིང་སེམས་ཀྱིས་མི་འཐུན་པར་སེམས་པ་མ་ཡིན།
en: Bodhisattvas are not like those who teach sweetly while thinking differently.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངག་གིས་སྟོན་ཅིང་སེམས་ཀྱིས་ངན་དུ་བྱ་བའི་སྦྱོར་བ་མི་བྱེད།
en: Bodhisattvas do not give oral teachings while their minds are involved in negative projects.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངག་གིས་འཇམ་པར་སྨྲ་ཞིང་སེམས་ཀྱིས་ཞེ་ལ་ནོན་ཏེ་ཤར་གཉེར་བ་མ་ཡིན།
en: Bodhisattvas do not speak gently while their minds are aggressive.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལུས་ཀྱིས་དེས་པ་སྟོན་ཅིང་སེམས་ཀྱིས་འཁོན་གྱི་མདུད་པར་འཛིན་པ་མ་ཡིན།
en: Bodhisattvas are not like those who pretend to be kind while their minds are tied up in grudges.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལུས་ཀྱིས་རི་མོར་བྱ་བ་སྟོན་ཅིང་སེམས་ཀྱིས་བརྙས་པར་བྱེད་པ་མ་ཡིན།
en: Bodhisattvas do not pay respect with their bodies while their minds harbor disdain.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཚུལ་མི་འཆོས། ཁ་གསག་མི་བྱེད།
en: Bodhisattvas are not hypocrites and are not flatterers.

source: འཇུངས་པ་དང་ཕྲག་དོག་གིས་ཀུན་ཏུ་གླགས་པ་མ་ཡིན།
en: They are not ruined by avarice and envy.

source: སྒྱུ་དང་གཡོས་མི་སྤྱོད། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཐབ་སྨྱན་མི་བྱེད། ཕན་ཚུན་དུ་དཔར་བ་འཇུག་པ་མ་ཡིན་གྱི།
en: They are not false and dishonest. They do not create animosity and they do not compete with one another.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལུས་ཀྱིས་ཀྱང་རི་མོ་བྱེད་པ་ཡིན། ངག་གིས་ཀྱང་ཡང་དག་པའི་དོན་སྨྲ་བ་ལས་སུ་རུང་བ་ཡང་སྒྲུབ་བོ།
en: Rather, bodhisattvas are physically respectful, speak meaningfully, and achieve flexibility.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སྐུར་པའི་ཕྱིར་ཞུགས་པ་མ་ཡིན་པས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སྐུར་པ་དང་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: Finally, since bodhisattvas do not engage with the teachings of the thus-gone ones in order to deny them, they do not deny the teachings of the thus-gone ones.

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སྐུར་པ་མ་བཏབ་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas not deny the teachings of the thus-gone ones?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Bodhisattvas arouse the mind set on unsurpassable and complete awakening.

source: སྐྲ་དང་ཁ་སྤུ་བྲེགས། གོས་ངུར་སྨྲིག་དག་གྱོན་ནས་ཡང་དག་པར་དད་པས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་ངོ་།
en: they shave off their hair and beard, don the saffron-colored robes, and faithfully receive ordination within the teachings of the thus-gone ones.

source: དེ་རབ་ཏུ་འབྱུང་བ་ན་རྒྱལ་པོས་མནར་བ་མེད་པར་རབ་ཏུ་འབྱུང་། རྐུན་པོས་གཙེ་བ་མེད་པ་དང་། བུ་ལོན་གྱིས་གཙེ་བ་མེད་པ་དང་། འཇིགས་པས་གཙེ་བ་མེད་པ་དང་། འཚོ་བ་མེད་པའི་འཇིགས་པས་སྐྲག་པ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་།
en: They do not receive such ordination to escape royal punishments, nor based on fears of thieves, debt, terrors, or lack of a livelihood.

source: དེ་དང་དེ་རབ་ཏུ་བྱུང་ནས་དགེ་བ་ཅི་ཡིན་ཞེས་འཚོལ་བ་ཡིན་ཏེ།
en: Rather, they receive ordination based on investigating the virtues involved in that.

source: དེ་དགེ་བ་ཅི་ཡིན་ཞེས་ཚོལ་བས་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་བསྙེན་པར་བྱེད། སྟེན་པར་བྱེད། བསྙེན་བཀུར་བྱེད་དོ། །དེ་དག་ལས་ཆོས་ཀྱང་ཉན་ཏོ།
en: Thus, knowing the value, they serve spiritual teachers, attend to them, venerate them, and listen to their teachings.

source: ཐོས་ནས་ཀྱང་ནན་ཏན་དུ་བྱེད། ང་རྒྱལ་གྱི་ཟིལ་གྱིས་མནོན་པ་ཡིན་ཏེ།
en: As they hear the teachings they apply them and subdue their pride.

source: དེ་ང་རྒྱལ་དང་བྲལ་བས་མ་ལོག་པར་འཛིན་པ་ཡིན། མ་ལོག་པར་འཛིན་པས་ལམ་ཤིན་ཏུ་རྟོགས་པ་ཐོབ་བོ།
en: Free of pride, they comprehend the teachings without error, and so they realize the path.

source: དེ་ལམ་ཤིན་ཏུ་རྟོགས་པས་ཆོས་ཉིད་ཐོབ་བོ།
en: Realizing the path, they attain the intrinsic nature.

source: ཆོས་ཉིད་ཐོབ་པས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་ཏེ།
en: As they attain the intrinsic nature they are certain to awaken to unsurpassable and complete buddhahood.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་སྐུར་པ་མ་བཏབ་པ་ཡིན་ནོ།
en: This is how bodhisattvas avoid denying the teachings of the thus-gone ones.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྣམ་པར་དག་པ་རྣམས་ཡིན་ནོ།
en: Thus, noble son, bodhisattvas who possess these ten qualities have a pure mind.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ནེམ་ནུར་མེད་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, because they possess ten qualities bodhisattvas are free of doubt.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བ་ལ་མངོན་པར་དད། དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་གསང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་སྒྲུབ་པ་དང་། བྱང་ཆུབ་དང་། དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་། ཐེག་པ་གཅིག་གི་ཚུལ་བསྟན་པ་དང་། ཚུལ་སྣ་ཚོགས་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་གི་སྒྲ་དབྱངས་ཟབ་མོ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུལ་བ་ལ་མངོན་པར་དད་དོ།
en: What are the ten? They are trust in the secret of the thus-gone ones’ body, trust in the secret of the thus-gone ones’ speech, trust in the secret of the thus-gone ones’ mind, trust in the authentic accomplishment of the bodhisattvas, trust in the emergence of the thus-gone ones, trust in the teachings on the principle of a single vehicle, trust in the teachings on the principle of the various ways, trust in the profound tune of the thus-gone ones’ voice, and trust in the training that accords with the minds of sentient beings.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བ་ལ་མངོན་པར་དད་པ་ནས་ཇི་ལྟར་ན་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུལ་བ་ལ་མངོན་པར་དད་པའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these forms of trust may imply, from trust in the secret of the thus-gone ones’ body through to trust in the training that accords with the minds of sentient beings.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་སོ།
en: “Noble son, bodhisattvas think,

source: གང་འདི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུ་དང་། ཞི་བའི་སྐུ་དང་། མི་མཉམ་པའི་སྐུ་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་སྐུ་དང་། ཚད་མེད་པའི་སྐུ་དང་། ཕལ་ལ་མེད་པའི་སྐུ་དང་། རྡོ་རྗེའི་སྐུ་ཞེས་བྱ་བ་ཐོས་པ་
en: ‘I have heard of the thus-gone ones’ body of qualities, their body of peace, their unequaled body, their matchless body, their limitless body, their unique body, and their vajra body.

source: འདི་ནི་ཡང་དག་པའོ། །འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ་སྙམ་སྟེ།
en: It is all true. It is reality. In this there is no deception.’

source: གནས་འདི་ལ་ནེམ་ནུར་མེད་ཅིང་ཐེ་ཙོམ་མེད་དེ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations, they trust in the secret of the body of the thus-gone ones.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in the secret of the speech of the thus-gone ones consist in?

source: གང་འདི་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་དེ་བཞིན་གཤེགས་པ་ནི་
en: ‘As for the secret of the thus-gone ones’ speech,

source: མངོན་སུམ་དུ་ལུང་སྟོན་པ་དང་། གསང་སྟེ་ལུང་སྟོན་པ་དང་། ལྡེམ་པོ་ངག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་
en: I have heard that they may reveal things directly or in secret, and that they may teach sentient beings with a concealed intention.

source: མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པའམ་ཅ་ཅོ་མེད་དེ།
en: Yet the thus-gone ones do not err and do not express themselves in meaningless ways.

source: དེའི་ཕྱིར་དེ་ལ་བརྫུན་དུ་སྨྲ་བའི་ཉེས་པ་མི་འབྱུང་ངོ་།
en: Therefore, they never commit the fault of lying.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ནི་སྐྱོན་ཐམས་ཅད་སྤངས་པ། དྲི་མ་ཐམས་ཅད་སྤངས་པ། རྡུལ་ཐམས་ཅད་སྤངས་པ། ཡོངས་སུ་གདུང་བ་ཐམས་ཅད་དང་བྲལ་བ།
en: And why is that? Because the thus-gone ones have abandoned all flaws, stains, and impurities.

source: ཡོངས་སུ་གདུང་བ་ཐམས་ཅད་དང་བྲལ་བ། ཉོན་མོངས་པ་མེད་པ།
en: They are free of all forms of agony and affliction.

source: དབང་དུ་གྱུར་པ། ཞི་བ། དང་བ། ཡོངས་སུ་དག་པ། རྙོག་པ་མེད་པ། རྣམ་པར་གསལ་བ་སྟེ།
en: They are trustworthy. They are peaceful, bright, pure, unstained, and clear.

source: གང་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་འཁྲུལ་པའམ། ཅ་ཅོ་འབྱུང་བ་དེ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དོ་
en: It is impossible and out of the question that the thus-gone ones could ever err or express themselves in meaningless ways.

source: ཞེས་ཐོས་པ་འདི་ནི་ཡང་དག་པའོ། །འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ་སྙམ་སྟེ།
en: All that I have heard about this is true. It is reality. In this there is no deception.’

source: གནས་འདི་ལ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད་དེ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations about this point, they trust in the secret of the thus-gone ones’ speech.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་གསང་བ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in the secret of the thus-gone ones’ mind consist in?

source: གང་འདི་དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་གསང་བ་དེ་བཞིན་གཤེགས་པས་ཅི་དགོངས་པའི་དོན་གང་སེམས་དང་འགྲོགས་པ། སེམས་ལ་གནས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་གྱུར་པ་
en: ‘The secret of the thus-gone ones’ mind is such that all that the thus-gone ones intend, all that they conceive of and express, and all that is on their minds occurs exclusively by the blessing of the thus-gone ones.

source: མ་གཏོགས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཤེས་པར་མི་ནུས་སོ།
en: It is all beyond the mental scope of any hearer, solitary buddha, bodhisattva, or sentient being.’

source: དེ་བཞིན་གཤེགས་པ་ནི་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ།
en: ‘The thus-gone ones are profound and hard to fathom,

source: བརྟག་པར་བྱ་བ་མ་ཡིན་པ། རྟོག་གེའི་སྤྱོད་ཡུལ་ལས་ཤིན་ཏུ་འདས་པ། དཔག་ཏུ་མེད་པ། རྒྱ་ཆེ་བ། ཡངས་པ། ནམ་མཁའི་དབྱིངས་དང་མཚུངས་པ།
en: inscrutable, utterly beyond the realm of logic, immeasurable, vast, wide, and equal to space.

source: རྟོག་གེ་ཐམས་ཅད་ཀྱི་ཡུལ་ལས་འདས་པར་ཐོས་པ་འདི་ནི་ཡང་དག་པའོ། འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ་སྙམ་སྟེ།
en: What I have heard is completely beyond the realm of logic. It is all true. It is reality. In this there is no deception.’

source: གནས་འདི་ལ་ནེམ་ནུར་མེད་ཐེ་ཙོམ་མེད་པ་ཡིན་ཏེ། དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་གསང་བ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations, they trust in the secret of the thus-gone ones’ mind.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in the authentic accomplishment of the bodhisattvas consist in?

source: བྱང་ཆུབ་ཀྱི་རྒྱུ། བྱང་ཆུབ་ཀྱི་གཞི། བྱང་ཆུབ་ཀྱི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སེམས་ཅན་གྱི་དོན་ལ་མངོན་དུ་ཕྱོགས་པ་དང་།
en: ‘The cause of awakening, the ground of awakening, and the objective of awakening are such that bodhisattvas turn toward the welfare of sentient beings.

source: སེམས་ཅན་གྱི་བྱ་བ་དང་། སེམས་ཅན་གྱི་བྱེད་པ་དང་།
en: Thus they engage in the works and activities of sentient beings.

source: ཡོངས་སུ་མི་སྐྱོ་བ་དང་། མི་སྐྲག་པ་དང་། ཁུར་ཆེན་པོ་ཁྱེར་བ་དང་།
en: Without ever tiring and without any fear, they carry the great load.

source: མཐུ་བརྟན་པ་དང་། རྟུལ་བ་བརྟན་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་སྒྲུབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མཐར་གྱིས་ཡང་དག་པར་སྒྲུབ་པ་དང་།
en: With stable power and steadfast exertion, they truly practice the transcendences and gradually accomplish the buddha qualities.

source: ཐོགས་པ་མེད་པའི་བློ་དང་། མཐའ་ཡས་པའི་བློ་དང་། མི་མཉམ་པའི་བློ་དང་། ཕལ་ལ་མེད་པའི་བློ་དང་།
en: Their minds are unimpeded and infinite, unequaled and extraordinary.

source: བརྩོན་འགྲུས་བརྟན་པ་དང་། གོ་ཆ་བརྟན་པ་དང་། དམ་བཅས་པ་བརྟན་པ་དང་། དམ་བཅས་པ་ལས་མི་གཡོ་བ་དང་།
en: With steadfast diligence, solid armor, and determined resolve their pledges are unyielding.

source: དམ་བཅས་པ་ཕལ་ལ་མེད་པ་དེ་དག་ཐམས་ཅད་རིམ་གྱིས་འཕེལ་ཞིང་རྒྱས་པ་དང་། ཡངས་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ་
en: All their extraordinary pledges they gradually increase and expand, allowing them to become immense until they reach perfection.

source: ཞེས་ཐོས་པ་འདི་ནི་ཡང་དག་པའོ། །འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ་སྙམ་སྟེ། གནས་འདི་ལ་དེ་ནེམ་ནུར་མེད།
en: This is what I have heard and all of it is true. It is reality. In this there is no deception.’

source: ཐེ་ཙོམ་མེད་དེ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་སྒྲུབ་པ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations about these matters, they trust in the authentic accomplishment of the bodhisattvas.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་དང་དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in awakening and the emergence of the thus-gone ones consist in?

source: གང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འདུག་ནས་ལྷའི་མིག་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་སྒྲིབ་པ་མེད་པ་འཐོབ་བོ།
en: ‘Once they have resided upon the seat of awakening, bodhisattvas achieve the divine eye that is free of any hindrance, impediment, or obscuration.

source: ལྷའི་རྣ་བ་དང་། གཞན་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་ཤེས་པ་དང་། ཟག་པ་ཟད་པ་ཤེས་པ་དང་། དུས་གསུམ་པ་སྐད་ཅིག་གཅིག་དང་ལྡན་པས་ཤེས་པ་
en: the divine ear, cognition of the minds of others, memory of past lives, miraculous cognition, knowledge of the exhaustion of defilements, and instantaneous knowledge of the three times.

source: ཆགས་པ་མེད་པ། ཐོགས་པ་མེད་པ། སྒྲིབ་པ་མེད་པ་འཐོབ་པོ།
en: All these are free of hindrance, impediment, or obscuration.

source: དེའི་ཕྱིར་སེམས་ཅན་གྱི་ཁམས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལྟ་སྟེ།
en: They will therefore regard the realms of sentient beings in accordance with reality.

source: སེམས་ཅན་འདི་རྣམས་ནི་ལུས་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ།
en: They notice certain beings who are involved in negative acts with body, speech, and mind.

source: འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། ལོག་པར་ལྟ་བ་རྣམས་ཏེ། ལོག་པར་ལྟ་བའི་ལས་དང་།
en: They notice beings who deprecate the noble ones, and who, based on their misperceptions, engage in acts and develop qualities that pertain to wrong view.

source: ཆོས་ཡང་དག་པར་བླངས་པའི་ཕྱིར་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་དག་ཏུ་སྐྱེའོ།
en: They perceive that due to such causes, such conditions, and such bases, when the bodies of those beings disintegrate and they die, they fall into the lower realms and are born in hell.

source: སེམས་ཅན་འདི་རྣམས་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: They likewise notice sentient beings who are involved in positive acts with their body, speech, and mind.

source: འཕགས་པ་ལ་སྐུར་པ་མི་འདེབས་པ། ཡང་དག་པར་ལྟ་བ་རྣམས་ཏེ། ཡང་དག་པར་ལྟ་བའི་ལས་དང་།
en: They notice such beings who do not deprecate noble ones and who, based on their correct perceptions, commit themselves to acts and qualities that pertain to correct view.

source: ཆོས་ཡང་དག་པར་བླངས་པའི་ཕྱིར་དེའི་རྒྱུ་དེའི་རྐྱེན་དེའི་གཞིས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷའི་ནང་དུ་སྐྱེའོ་
en: They see that, due to such causes, such conditions, and such bases, their death due to the destruction of the body brings a passage to the joys of the higher realms where they are born among the gods.

source: སྙམ་ནས་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་གྱི་ཁམས་ལ་ལྟ་སྟེ། སེམས་ཅན་གྱི་ཁམས་དེ་ཉིད་ཀྱི་དགེ་བ་དང་། མི་དགེ་བའི་ལས་རྣམས་ལ་རྣམ་པར་ལྟའོ།
en: In this way they regard the realms of sentient beings in accordance with reality, perceiving the virtuous and unvirtuous actions in the realms of sentient beings.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Furthermore, they will think,

source: སྔོན་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པས་གང་འདི་ལྟར་
en: “In the past, when I was practicing bodhisattva activity,

source: བདག་ཉིད་རྣམ་པར་སངས་རྒྱས་ནས་གཞན་ཡང་རྣམ་པར་སངས་རྒྱས་པར་བྱའོ་ཞེས་དམ་བཅས་པའི་
en: I pledged to awaken to buddhahood so that I could lead others to buddhahood as well.

source: བདག་གི་སྨོན་ལམ་དེ་ཡོངས་སུ་རྫོགས་སོ། །བདག་གི་བརྣག་པ་དེ་ཡོངས་སུ་རྫོགས་སོ་སྙམ་མོ་ཞེས་
en: Such was my aspiration and it has now been perfected; my pledge has now been fulfilled.”

source: ཐོས་པ་འདི་ནི་ཡང་དག་པའོ། །འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ་སྙམ་སྟེ།
en: This is what I have heard, and all of it is true. It is reality. In this there is no deception.

source: གནས་འདི་ལ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད་དོ།
en: About these matters I have no doubts or reservations.

source: གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམ་པར་སངས་རྒྱས་པ་དེ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ།
en: That which we refer to as awakening is the bodhisattva’s attainment of buddhahood,

source: བདག་ཉིད་རྣམ་པར་སངས་རྒྱས་པས་ན་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱ་སྟེ།
en: when I myself gain that state I will be known as a perfect buddha.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་དང་། དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་ལ་མངོན་པར་དད་དོ།
en: In this way bodhisattvas trust in awakening and the emergence of the thus-gone ones.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་གཅིག་གི་ཚུལ་བསྟན་པ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in teachings on the principle of a single vehicle consist in?

source: དེ་འདི་ལྟར་སེམས་སོ། །གང་འདི་ཐེག་པ་ནི་གཅིག་ཁོ་ན་ཏེ། འདིལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཐེག་པའོ་
en: Bodhisattvas think as follows: ‘The vehicles are one: the vehicle of the thus-gone ones.

source: ཞེས་ཐོས་པ་འདི་ནི་ཡང་དག་པའོ།
en: This is what I have heard and it is all true.

source: འདི་ནི་དེ་ཁོ་ནའོ། །འདི་ནི་མི་སླུ་བའོ། །འདི་ནི་དེ་བཞིན་པའོ།
en: This is reality. In this there is no deception. It is exactly this way.

source: མ་ནོར་པའོ། །གཞན་མ་ཡིན་པའོ།
en: Without any error, the truth is nothing else than this.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཐེག་པ་གཞན་རྣམས་ཀྱང་འདི་ལས་བྱུང་ངོ་།
en: And why? Because all other vehicles emerge from this one.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་འཛམ་བུའི་གླིང་ན་གང་གླིང་ཡོད་པ་རྣམས་མིང་གིས་ཐ་དད་པར་ཤེས་མོད་ཀྱི། འོན་ཀྱང་དེ་དག་ནི་འཛམ་བུའི་གླིང་དུ་འདུའོ།
en: Noble son, although we know of the various areas of Jambu­dvīpa by different names, still they are all included within Jambu­dvīpa.

source: འཛམ་བུའི་གླིང་ལ་རྟེན་ཏོ། །འཛམ་བུའི་གླིང་གི་གྲངས་སུ་འགྲོའོ།
en: They are based on and belong to Jambu­dvīpa.

source: དེའི་ཕྱིར་ན་གླིང་གཅིག་ཁོ་ན་སྟེ། དེ་ནི་འཛམ་བུའི་གླིང་ངོ་།
en: For this reason they are all one continent of Jambu­dvīpa.

source: དེ་བཞིན་དུ་ཐེག་པ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་ཐེག་པར་འདུའོ།
en: Similarly, all the vehicles are included in the vehicle of the thus-gone ones.

source: དེ་བཞིན་གཤེགས་པའི་ཐེག་པ་ལ་གནས་སོ། །དེ་བཞིན་གཤེགས་པའི་ཐེག་པ་ལས་བྱུང་བའོ།
en: They remain within and emerge from the vehicle of the thus-gone ones.

source: དེའི་ཕྱིར་ཐེག་པ་གཅིག་ཁོ་ན་སྟེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཐེག་པའོ་སྙམ་སྟེ།
en: Thus they feel, ‘The vehicles are, therefore, nothing but a single vehicle: the vehicle of the thus-gone ones.’

source: གནས་འདི་ལ་དེ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད་དེ་
en: About this matter they have no doubts or reservations.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་གཅིག་གི་ཚུལ་བསྟན་པ་ལ་མངོན་པར་དད་དོ།
en: Thus, bodhisattvas have trust in the teachings on the principle of a single vehicle.

source: ཇི་ལྟར་ན་ཚུལ་སྣ་ཚོགས་བསྟན་པ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in the teachings on the principle of the various ways consist in?

source: གང་འདི་མདོ་སྡེ་དེ་དང་དེ་དག་ལས་དེ་བཞིན་གཤེགས་པའི་ཚུལ་སྣ་ཚོགས་བཤད་པ་
en: ‘In the different discourses many different ways of the thus-gone ones are explained.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདུལ་བའི་དབང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དད་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ་སྙམ་སྟེ།
en: And why is that? Because the thus-gone ones teach the Dharma to sentient beings in accord with their different levels of faith and for the sake of training them.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་སྣ་ཚོགས་བསྟན་པ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations about these matters, bodhisattvas have trust in the teachings on the principle of the various ways.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་གསུང་སྒྲའི་དབྱངས་ཟབ་མོ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “What, you may wonder, does the bodhisattvas’ trust in the profound tune of the thus-gone ones’ voice consist in?

source: གང་འདི་དེ་བཞིན་གཤེགས་པའི་གསུང་སྒྲའི་དབྱངས་ཟབ་མོ་ཐོས་པ་འདི་ནི་ཡང་དག་པའོ། །
en: Bodhisattvas think as follows: ‘All that I have heard of the profound tune of the thus-gone ones’ voice is true.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་བའི་རྩ་བ་ཆུང་ངུའི་ལྷའི་བུ་རྣམས་ཀྱི་དབྱངས་ཀྱང་ཟབ་ཅིང་སྙན་པ་ཡིན་ན།
en: And why is that? Because when even gods endowed with minor roots of virtue possess a voice that is both profound and pleasing,

source: བསྐལ་པ་བརྒྱ་སྟོང་དུ་མར་དགེ་བའི་རྩ་བ་བསྒྲུབས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ལྟ་ཅི་སྨོས་སྙམ་སྟེ།
en: then it goes without saying that this is also the case for the thus-gone ones who have accomplished roots of virtue throughout millions of eons.’

source: གནས་འདི་ལ་དེ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད་དེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་གསུང་སྒྲའི་དབྱངས་ཟབ་མོ་ལ་མངོན་པར་དད་དོ།
en: Thus, without any doubts or reservations about these matters, bodhisattvas have trust in the profound tune of the thus-gone ones’ voice.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུལ་བ་ལ་མངོན་པར་དད་ཅེ་ན།
en: “You may wonder, noble son, what is meant by the bodhisattvas’ trust in the training that accords with the minds of sentient beings.

source: གང་འདི་དེ་བཞིན་གཤེགས་པ་བསམ་པ་དང་། བག་ལ་ཉལ་མཁྱེན་ཏེ།
en: ‘The thus-gone ones know the minds and latent tendencies of sentient beings.

source: སེམས་ཅན་མོས་པ་ཐ་དད་པ་དང་། འདུལ་བ་ཐ་དད་པ་རྣམས་ལ་གསུང་སྒྲའི་དབྱངས་གཅིག་བརྗོད་པས་ཐེ་ཙོམ་གཅོད་ཅིང་ཡོངས་སུ་སྨིན་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་འདུལ་ལོ།
en: As one single expression of a thus-gone one is received by sentient beings who each have their own wishes and individual levels of training, it cuts through the doubts of all of them, matures them, and properly trains them.

source: སེམས་ཅན་རྣམས་ཀྱང་སོ་སོ་ནས་དེ་བཞིན་གཤེགས་པ་བདག་ལ་ཆོས་སྟོན་ཏེ། །དེ་བཞིན་གཤེགས་པ་བདག་ལ་ཆོས་སྟོན་ཏོ་སྙམ་བྱེད་ཀྱང་
en: Although beings may individually think that the thus-gone ones have taught the Dharma specifically to them,

source: དེ་བཞིན་གཤེགས་པ་ནི་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ་
en: the thus-gone ones are beyond thoughts and concepts.

source: གནས་འདི་ལ་དེ་ནེམ་ནུར་མེད། ཐེ་ཙོམ་མེད་དེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུལ་བ་ལ་མངོན་པར་དད་དོ།
en: Thus, noble son, without any doubts or reservations about these matters, bodhisattvas have trust in the training that accords with the minds of sentient beings.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ནེམ་ནུར་མེད་པ་རྣམས་ཡིན་ནོ།
en: Noble son, endowed with these ten qualities bodhisattvas possess a mind that is free of doubt.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་རྒྱ་མཚོ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, because they possess ten qualities bodhisattvas have a mind that is like the ocean.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་གྱུར་པ་རྣམས་ཡིན། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་རྣམས་ཡིན། རྒྱ་ཆེ་ཞིང་ཚད་མེད་པ་རྣམས་ཡིན། བགས་ཀྱིས་གཞོལ་བ་རྣམས་ཡིན། ཉོན་མོངས་པའི་རོ་དང་ལྷན་ཅིག་མི་འདུག་པ་རྣམས་ཡིན། རོ་གཅིག་པ་རྣམས་ཡིན། ཆུ་བོ་ཀུན་ཟེད་པ་རྣམས་ཡིན། དུས་ལས་མི་ཡོལ་བ་རྣམས་ཡིན། འབྱུང་པོ་མང་པོའི་གནས་སུ་གྱུར་པ་རྣམས་ཡིན། མི་ཟད་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are being a source of jewels, being deep and hard to fathom, being vast and boundless, being in constant flow, being free of the corpse of affliction, being of a single taste, receiving all rivers, never being late, being the abode of numerous spirits, and being inexhaustible.
